### Unit 6. 변수와 입력 사용하기
## 6.3 입력 값을 변수에 저장하기


## 6.3.1 input 함수 사용하기
# input()
# Hello, world! (입력)
# 'Hello, world!'


## 6.3.2 input 함수의 결과를 변수에 할당하기
# 변수 = input()
# x = input()
# Hello, world! (입력)
# print(x)

# 변수 = input('문자열')
# x = input('문자열을 입력하세요: ')
# 문자열을 입력하세요: Hello, world! (입력)
# x
# 'Hello, world!'


## 6.3.3 두 숫자의 합 구하기
# a = input('첫 번째 숫자를 입력하세요: ')
# 첫 번째 숫자를 입력하세요: 10 (입력)
# b = input('두 번째 숫자를 입력하세요: ')
# 두 번째 숫자를 입력하세요: 20 (입력)
 
# print(a + b)
# 1020              # str이기 때문에 이리 나옴



## 6.3.4 입력 값을 정수로 변환하기
# 변수 = int(input())
# 변수 = int(input('문자열'))
# a = int(input('첫 번째 숫자를 입력하세요: '))    # int를 사용하여 입력 값을 정수로 변환
# b = int(input('두 번째 숫자를 입력하세요: '))    # int를 사용하여 입력 값을 정수로 변환

# print(a + b)

# 첫 번째 숫자를 입력하세요: 10 (입력)
# 두 번째 숫자를 입력하세요: 20 (입력)
# 30

